# WireConduitType Properties

---
The WireConduitType type exposes the following members.
| Name| Description
---|---|---
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
| Name|
Top
#### Reference
WireConduitType Class
Autodesk.Revit.DB.Electrical Namespace